.config/doom/modules/email/notmuch-patch/config.org
#+TITLE: Config
#+property: header-args:emacs-lisp :tangle yes
#+property: header-args:elisp :tangle yes

* setup
need to find a good way to automate this, but for now:
#+begin_src sh
# install deps, general notmuch config
go install gitlab.com/shackra/goimapnotify@latest
pip install orgparse afew oauth2token lieer
let-env NOTMUCH_CONFIG = ("~/.config/notmuch/default/config" | path expand)
notmuch
notmuch setup # might not be necessary
notmuch new # seems to be necessary for setting up the xapian db

# setup gmail
# TODO once this is really stable, add all of this to the gmail install script
# for each gmail account
# first time: create new oauth app by going to https://console.cloud.google.com/apis/credentials
#   - create "Oauth client ID"
#   - type: desktop app
mkdir ~/.local/share/mail/account.<ACCOUNT_NAME>
cd ~/.local/share/mail/account.<ACCOUNT_NAME>
rm -f .gmailieer.json & rm -f .credentials.gmailieer.json rm -f .lock & rm -r ./*
gmi init your.email@gmail.com
# NOTE had to disable google advanced security to allow gmi's oauth
gmi pull
~/.config/goimapnotify/install-mailbox-daemon.sh --mailbox=<ACCOUNT_NAME> --provider=gmail
# if you run into issues, uninstall with the uninstall script (which also clears the logs; convenient for debugging)
~/.config/goimapnotify/uninstall-mailbox-daemon.sh --mailbox=<ACCOUNT_NAME>

# set up gpg
ln -s ~/.local/share/private/gpg/gpg.conf ~/.gnupg/gpg.conf
ln -s ~/.local/share/private/gpg/gpg-agent.conf ~/.gnupg/gpg-agent.conf
# or ln -s ~/.local/share/private/gpg/gpg-agent.m1.conf ~/.gnupg/gpg-agent.conf
let-env KEYID = "0x571438EB48F2B1EA"
gpg --recv $env.KEYID
gpg --edit-key $env.KEYID
> trust
> 5
> y
> quit
# remove/re-insert yubikey
gpg --card-status
# should have sec# for master key, and ssb> for others

# set up protonmail
# TODO once this is really stable, add all of this to the protonmail install script
# TODO maybe just use authinfo for this
# add local protonmail bridge password to keepassxc
(echo (keepassxc-cli show --show-protected ~/.local/share/private/Passwords.kdbx protonmail-bridge
       | grep Password
       | sed 's/Password: //')
 | gpg --encrypt --armor --recipient $env.KEYID -o ~/.local/share/mail/account.protonmail/pass.gpg)
let-env DECRYPTED_PASS = (gpg --use-agent --decrypt --armor --local-user 0x7FE626F169E66EFA ~/.local/share/mail/account.protonmail/pass.gpg)
# set up ssl
openssl s_client -starttls imap -connect 127.0.0.1:1143 -showcerts
# copy cert and write to file:
sudo emacs -nw /etc/ssl/certs/mbsync.crt
# test sync
mbsync --all --config ~/.config/mbsync/mbsyncrc
# start daemon
~/.config/goimapnotify/install-mailbox-daemon.sh --mailbox=protonmail --provider=protonmail
# if you run into issues, uninstall with the uninstall script (which also clears the logs; convenient for debugging)
~/.config/goimapnotify/uninstall-mailbox-daemon.sh --mailbox=protonmail
#+end_src
* contacts
Manage contacts with org mode, so they're easy to interact with from emacs (especially notmuch).
Also, we'll want it to be easy to set/get an email group from notmuch for a given email, so let's define that here.
#+begin_src emacs-lisp :tangle packages.el
(package! org-contacts)
#+end_src
#+begin_src elisp
(use-package org-contacts
  :ensure nil
  :after (org doct)
  :custom
  (org-contacts-files '("~/.local/share/notes/contacts.org"))
  (notmuch-address-command 'as-is)
  (org-capture-templates
   (append org-capture-templates
           (doct `(("Contact"
                    :keys "c"
                    :file "~/.local/share/notes/contacts.org"
                    ;; NOTE: Not using my property hook bc I haven't gotten it
                    ;;       to handle %^-style variable setting yet.
                    :template ("* %(org-contacts-template-name)"
                               ":PROPERTIES:"
                               ":EMAIL: %^{EMAIL}p"
                               ;; hey.com style email groups, used to categorize emails in notmuch
                               ":EMAIL-GROUP: %^{EMAIL-GROUP|screener|imbox|feed|paper-trail}"
                               ":BIRTHDAY: %^{BIRTHDAY|yyyy-mm-dd}p"
                               ":NOTE: %^{NOTE}p"
                               ":END:")
                    :kill-buffer t)))))
  :commands (+patch/get-email-group-for-email-sender +patch/set-email-group-for-email-sender)
  :defines (+patch/get-email-group-for-email-sender +patch/set-email-group-for-email-sender)
  :config
  (defun +patch/get-org-contact-by-email (email)
    ;; notably, this just returns the first match
    (car (org-contacts-filter nil nil `("EMAIL" . ,email))))

  (defun +patch/get-email-group-for-email-sender (email)
    (let* ((contact (+patch/get-org-contact-by-email email))
           (contact-info (nth 2 contact)))
      (cdr (assoc-string "EMAIL-GROUP" contact-info))))

  (defmacro +patch--from-contact-location (email &rest body)
    `(let* ((contact (+patch/get-org-contact-by-email email))
            (contact-marker (nth 1 contact)))
       (with-current-buffer (marker-buffer contact-marker)
         (save-excursion
           (goto-char contact-marker)
           ,@body))))

  (defmacro +patch--from-contact-file (email &rest body)
    `(let* ((contact (+patch/get-org-contact-by-email email))
            (contact-marker (nth 1 contact)))
       (with-current-buffer (find-file-noselect (car org-contacts-files))
         (save-excursion
           ,@body))))

  (defun +patch-notmuch/email-is-pattern (email)
    (and (s-prefix? "/" email)
         (s-suffix? "/" email)))

  (defun +patch/strip-from-string (border-string full-string)
    (string-remove-prefix border-string (string-remove-suffix border-string full-string)))

  (defun +patch/add-org-contact (name email &optional email-group note bday)
    (+patch--from-contact-file email
     (end-of-buffer)
     (org-insert-heading nil nil t)  ;; force a top-level heading
     (insert name)
     (org-entry-put (point) "EMAIL" email)
     (when (+patch-notmuch/email-is-pattern email)
         (org-entry-put (point) "EMAIL-PATTERN" (+patch/strip-from-string "/" email)))
     (org-entry-put (point) "EMAIL-GROUP" email-group)
     (org-entry-put (point) "NOTE" note)
     (org-entry-put (point) "BIRTHDAY" bday)))

  (defun +patch/set-email-group-for-email-sender (name email email-group)
    (if (+patch/get-org-contact-by-email email)
        (+patch--from-contact-location email
                                       (org-set-property "EMAIL-GROUP" email-group))
      (+patch/add-org-contact name email email-group))))
#+end_src

I use this header in my contacts file, so that it renders as a column view (see [[https://orgmode.org/manual/Column-View.html][org's column view docs]] and [[https://orgmode.org/manual/Initial-visibility.html][on initial visibility]] for more info. Also, [[https://emacs.stackexchange.com/a/39007/15634][this SE post]] for the hack to get column views to render by default):
#+begin_src org :tangle no
#+COLUMNS: %20ITEM %EMAIL %EMAIL-GROUP %BIRTHDAY %NOTE
#+STARTUP: overview
# Local Variables:
# eval: (org-columns t)
# End:
#+end_src

