.config/doom/modules/email/notmuch-patch/config.el
(use-package org-contacts
  :ensure nil
  :after (org doct)
  :custom
  (org-contacts-files '("~/.local/share/notes/contacts.org"))
  (org-capture-templates
   (append org-capture-templates
           (doct `(("Contact"
                    :keys "c"
                    :file "~/.local/share/notes/contacts.org"
                    ;; NOTE: Not using my property hook bc I haven't gotten it
                    ;;       to handle %^-style variable setting yet.
                    :template ("* %(org-contacts-template-name)"
                               ":PROPERTIES:"
                               ":EMAIL: %^{EMAIL}p"
                               ;; hey.com style email groups, used to categorize emails in notmuch
                               ":EMAIL-GROUP: %^{EMAIL-GROUP|screener|imbox|feed|paper-trail}"
                               ":BIRTHDAY: %^{BIRTHDAY|yyyy-mm-dd}p"
                               ":NOTE: %^{NOTE}p"
                               ":END:")
                    :kill-buffer t)))))
  :commands (+patch/get-email-group-for-email-sender +patch/set-email-group-for-email-sender)
  :defines (+patch/get-email-group-for-email-sender +patch/set-email-group-for-email-sender)
  :config
  (defun +patch/get-org-contact-by-email (email)
    ;; notably, this just returns the first match
    (car (org-contacts-filter nil nil `("EMAIL" . ,email))))

  (defun +patch/get-email-group-for-email-sender (email)
    (let* ((contact (+patch/get-org-contact-by-email email))
           (contact-info (nth 2 contact)))
      (cdr (assoc-string "EMAIL-GROUP" contact-info))))

  (defmacro +patch--from-contact-location (email &rest body)
    `(let* ((contact (+patch/get-org-contact-by-email email))
            (contact-marker (nth 1 contact)))
       (with-current-buffer (marker-buffer contact-marker)
         (save-excursion
           (goto-char contact-marker)
           ,@body))))

  (defmacro +patch--from-contact-file (email &rest body)
    `(let* ((contact (+patch/get-org-contact-by-email email))
            (contact-marker (nth 1 contact)))
       (with-current-buffer (find-file-noselect (car org-contacts-files))
         (save-excursion
           ,@body))))

  (defun +patch/add-org-contact (name email &optional email-group note bday)
    (+patch--from-contact-file email
     (end-of-buffer)
     (org-insert-heading nil nil t)  ;; force a top-level heading
     (insert name)
     (org-entry-put (point) "EMAIL" email)
     (org-entry-put (point) "EMAIL-GROUP" email-group)
     (org-entry-put (point) "NOTE" note)
     (org-entry-put (point) "BIRTHDAY" bday)))

  (defun +patch/set-email-group-for-email-sender (name email email-group)
    (if (+patch/get-org-contact-by-email email)
        (+patch--from-contact-location email
                                       (org-set-property "EMAIL-GROUP" email-group))
      (+patch/add-org-contact name email email-group))))
