.config/doom/modules/email/notmuch-patch/config.el

;; this seems to have been removed from notmuch, but I'll keep a copy here
(after! notmuch

  (general-define-key
   :keymaps 'notmuch-search-mode-map
   :states '(normal)
   "f" (cmd! (+patch-notmuch/move-thread-to-group "feed"))
   "F" (cmd! (+patch-notmuch/add-sender-to-group "feed"))
   "i" (cmd! (+patch-notmuch/move-thread-to-group "imbox"))
   "I" (cmd! (+patch-notmuch/add-sender-to-group "imbox"))
   "p" (cmd! (+patch-notmuch/move-thread-to-group "paper-trail"))
   "P" (cmd! (+patch-notmuch/add-sender-to-group "paper-trail"))
   "t" #'+patch-notmuch/move-thread-to-group
   "T" #'+patch-notmuch/add-sender-to-group
   "-" nil)
  (general-define-key
   :keymaps 'notmuch-search-mode-map
   :states '(normal)
   :prefix "-"
   "t" #'notmuch-search-filter-by-tag)

  (defgroup patch-notmuch nil
    "My personal notmuch config group"
    :group 'convenience
    :prefix "+patch-notmuch")
  ;; making this custom while I'm thinking about it, in case I ever get around
  ;; to breaking this into it's own package.
  (defcustom +patch-notmuch/tag-retroactively 'prompt
    "When adding a sender to a group, always set all existing emails"
    :group 'patch-notmuch
    :type '(choice (const :tag "Always" always)
            (const :tag "Never" never)
            (const :tag "Prompt" prompt)))
  (setq +patch-notmuch/tag-retroactively 'always)

  (defun +patch-notmuch--query-get-threads (search-terms)
    "Return a list of threads of messages matching SEARCH-TERMS.

A thread is a forest or list of trees. A tree is a two element
list where the first element is a message, and the second element
is a possibly empty forest of replies."
    (let ((args '("show" "--format=sexp" "--format-version=5")))
      (when notmuch-show-process-crypto
        (setq args (append args '("--decrypt=true"))))
      (setq args (append args search-terms))
      (apply #'notmuch-call-notmuch-sexp args)))

  (defun +patch-notmuch/get-thread (&optional thread-id)
    (let* ((thread-id (or thread-id (notmuch-search-find-thread-id)))
           (threads (+patch-notmuch--query-get-threads (list thread-id))))
      (caaar threads)))

  (defun +patch-notmuch/get-email-from-notmuch-search (&optional thread-id)
    (let* ((thread-id (or thread-id (notmuch-search-find-thread-id)))
           (thread (+patch-notmuch/get-thread thread-id))
           (headers (plist-get thread :headers)))
      (or
       (plist-get headers :Reply-To)
       (plist-get headers :From))))


  (defun +patch-notmuch/add-sender-to-group (group &optional thread-id tag-retroactively)
    "Add sender of thread from THREAD-ID to GROUP. From now on, all emails from this
sender will be tagged with GROUP.

If TAG-RETROACTIVELY is specified, all emails from this sender will be tagged
with GROUP.

Group seting is done by setting the EMAIL-GROUP property of the sender's contact
in org-contacts. If the contact does not exist, it will be created.
Tagging of future messages is done by the HeyFilter afew filter."
    (interactive (list (completing-read "Email group: " '("feed" "paper-trail" "imbox"))))
    ;; TODO prompt whether to set tags for existing messages from sender
    ;;      - could have a config value to determine this behavior
    ;;      - could (maybe additionally) determine via prefix args and/or function args
    (let* ((email (+patch-notmuch/get-email-from-notmuch-search thread-id))
           (name (notmuch-search-find-authors))  ;; used to set name of contact, if we have to make a new contact
           (tag-retroactively (or tag-retroactively
                                  +patch-notmuch/tag-retroactively
                                  (yes-or-no-p (format "Retroactively update tags for messages from %s?" email))))
           (tag-changes (cond ((equal group "feed") '("+feed" "-screener" "-paper-trail" "-imbox" "-unread"))
                              ((equal group "paper-trail") '("+paper-trail" "-screener" "-feed" "-imbox"))
                              ((equal group "imbox") '("+imbox" "-screener" "-paper-trail" "-feed"))
                              (t `(,(format "+%s" group) "-screener" "-paper-trail" "-feed" "-imbox")))))
      (+patch/set-email-group-for-email-sender name email group)
      (notmuch-search-tag tag-changes)
      (when tag-retroactively
        (notmuch-tag (format "from:%s" email) tag-changes))))

  (defun +patch-notmuch/move-thread-to-group (group &optional thread-id)
    "Tag thread from THREAD-ID with GROUP"
    (interactive (list (completing-read "Email group: " '("feed" "paper-trail" "imbox"))))
    (let* ((email (+patch-notmuch/get-email-from-notmuch-search thread-id))
           (tag-changes (cond ((equal group "feed") '("+feed" "-screener" "-paper-trail" "-imbox" "-unread"))
                              ((equal group "paper-trail") '("+paper-trail" "-screener" "-feed" "-imbox"))
                              ((equal group "imbox") '("+imbox" "-screener" "-paper-trail" "-feed"))
                              (t `(,(format "+%s" group) "-screener" "-paper-trail" "-feed" "-imbox")))))
      (notmuch-search-tag tag-changes))))

(after! notmuch
  ;; for some reason, the python notmuch client that gmi uses can't find my XDG notmuch config without this
  (setenv "NOTMUCH_CONFIG" (expand-file-name "~/.config/notmuch/default/config"))

  (setq send-mail-function #'smtpmail-send-it
        message-sendmail-f-is-evil t
        message-send-mail-function #'message-send-mail-with-sendmail)

  (defun +patch--get-my-email-address-in-message ()
    (car (mail-header-parse-address (message-field-value "From"))))

  (defun +patch--set-lieer-as-smtp-client ()
    (setq sendmail-program (executable-find "gmi")
          message-sendmail-extra-arguments '("send" "--quiet" "--read-recipients" "--path" "~/.local/share/mail/account.kelleys-gmail")))

  (defun +patch--set-msmtp-as-smtp-client ()
    (setq sendmail-program (executable-find "msmtp")
          message-sendmail-extra-arguments '("--read-envelope-from")))

  ;; TODO find elegant way to use account-specific settings
  (defun +patch--set-smtp-client ()
    (let ((email-address (+patch--get-my-email-address-in-message)))
      (cond ((string-match-p email-address "patrick@the-kelleys.com")
             (+patch--set-lieer-as-smtp-client)
             (setq org-msg-signature plain-org-msg-signature))
            ((string-match-p email-address "pakelley@pm.me")
             (+patch--set-msmtp-as-smtp-client)
             (setq org-msg-signature plain-org-msg-signature))
            ((string-match-p email-address "patrick@heartex.com")
             (+patch--set-lieer-as-smtp-client)
             (setq org-msg-signature heartex-org-msg-signature))
            ((t) (message (format "Could not find smtp client for email address: %s" email-address))))))

  (add-hook 'notmuch-mua-send-hook #'+patch--set-smtp-client))
