.config/doom/modules/email/notmuch-patch/config.el

(use-package! org-msg
  :after notmuch
  :custom
  (org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil tex:dvipng")
  (org-msg-startup "hidestars indent inlineimages")
  (org-msg-greeting-name-limit 3)
  (org-msg-default-alternatives '((new . (utf-8 html))
                                  (reply-to-text . (utf-8))
                                  (reply-to-html . (utf-8 html))))
  (org-msg-convert-citation t)
  ;; The default attachment matcher gives too many false positives,
  ;; it's better to be more conservative. See https://regex101.com/r/EtaiSP/4.
  (org-msg-attached-file-reference
   "see[ \t\n]\\(?:the[ \t\n]\\)?\\(?:\\w+[ \t\n]\\)\\{0,3\\}\\(?:attached\\|enclosed\\)\\|\
(\\(?:attached\\|enclosed\\))\\|\
\\(?:attached\\|enclosed\\)[ \t\n]\\(?:for\\|is\\)[ \t\n]")
  (heartex-org-msg-signature (let* ((fname "~/.config/doom/modules/email/notmuch-patch/signature.html")
                            (fpath (expand-file-name fname))
                            (signature-html (with-current-buffer (find-file-noselect fpath t)
                                              (buffer-string))))
                       (format "\n\n#+BEGIN_EXPORT html\n%s\n#+END_EXPORT" signature-html)))
  (plain-org-msg-signature "Best,\nPatrick")
  :config
  (org-msg-mode)
  (org-msg-mode-notmuch)
  ;; (defun my-org-msg-composition-parameters (orig-fun &rest args)
  ;;   "Tweak my greeting message and my signature when replying as
  ;;  plain/text only."
  ;;   (let* ((res (apply orig-fun args))
  ;;          ())
  ;;     (when (equal (cadr args) '(text))
  ;;   (setf (alist-get 'greeting-fmt res) "\n")
  ;;   (setf (alist-get 'signature res)
  ;;         (replace-regexp-in-string "\\([\*/]\\|\nRegards,\n\n\\)" ""
  ;;                   org-msg-signature)))
  ;;     res))
  ;; (advice-add 'org-msg-composition-parameters
  ;;         :around #'my-org-msg-composition-parameters)
  )

(after! notmuch
