.config/doom/modules/email/notmuch-patch/config.org
** org agenda in message view
#+begin_src emacs-lisp :tangle yes
(after! notmuch
  (defun notmuch-agenda-event-time (event zone-map property)
    "Given an EVENT and a ZONE-MAP, turn the icalendar timestamp
  for PROPERTY into an emacs internal time representation"
    (let* ((timestamp (icalendar--get-event-property event property))
           (zone (icalendar--find-time-zone (icalendar--get-event-property-attributes event property)
                                            zone-map)))
      (icalendar--decode-isodatetime timestamp nil zone)))

  (defun +patch/relative-date-plain-english-description (now comparison-ts)
    (let* ((now-encoded (apply 'encode-time now))
           (comparison-ts-encoded (apply 'encode-time comparison-ts))
           (today (nth 3 now))
           (comparison-day (nth 3 comparison-ts))
           (seconds-until-event (float-time (time-subtract comparison-ts-encoded now-encoded)))
           (days-until-event (/ seconds-until-event 86400))
           (event-in-past (< days-until-event 0))
           (days-away-from-event (abs days-until-event))
           (rem-days (% (ceiling days-away-from-event) 7))
           (weeks-away-from-event (floor (/ days-away-from-event 7))))
      (cond
       ((and (< days-away-from-event 2)
             (= today comparison-day))
        "today")
       ((and (< days-away-from-event 2)
             (= (abs (- today comparison-day)) 1 ))
        (if event-in-past "yesterday" "tomorrow"))
       ((< days-away-from-event 8)
        (format "%d days%s" (ceiling days-away-from-event) (if event-in-past " ago" "")))
       (t (format "%d week%s%s%s"
                  weeks-away-from-event
                  (if (= 1 weeks-away-from-event) "" "s")
                  (if (zerop rem-days) ""
                    (format " %d days" rem-days))
                  (if event-in-past " ago" ""))))))

  ;; TODO rewrite this (and function above) using ts library
  (defun +patch/notmuch-agenda-friendly-date (dtstart)
    (let* ((now (decode-time (current-time)))
           (start-time (format-time-string "%a, %d %b %H:%M" (apply 'encode-time dtstart)))
           (rel-date (+patch/relative-date-plain-english-description now dtstart)))
      (concat start-time " (" rel-date ")")))

  (defun notmuch-agenda-insert-agenda (event zone-map)
    (require 'org)
    (let* ((dtstart (notmuch-agenda-event-time event zone-map 'DTSTART))
           (wins (current-window-configuration))
           (org-agenda-sticky nil)
           (inhibit-redisplay t)
           (year (nth 5 dtstart))
           (month (nth 4 dtstart))
           (day (nth 3 dtstart))

           (org-agenda-custom-commands '(("q" "Mail agenda" ((agenda ""))))))
      (cl-progv
          ;; `,@(-unzip (org-make-parameter-alist
          ;;          `(org-agenda-span 'day
          ;;            org-agenda-start-day ,(format "%04d-%02d-%02d" 2022 04 20)
          ;;            org-agenda-use-time-grid nil
          ;;            org-agenda-remove-tags t
          ;;            org-agenda-window-setup 'nope)))
          '(org-agenda-span
            org-agenda-start-day
            org-agenda-use-time-grid
            org-agenda-remove-tags
            org-agenda-window-setup)
          (list 'day
                (format "%04d-%02d-%02d" year month day)
                nil
                t
                'nope)
        (progn
          (save-excursion
            (org-agenda nil "q")
            (org-agenda-redo)
            (setq org-agenda-mail-buffer (current-buffer)))
          (set-window-configuration wins)
          (let ((p (point))
                pa)
            ;; copy text
            (insert-buffer-substring org-agenda-mail-buffer)

            ;; copy markers
            (save-restriction
              (narrow-to-region p (point))
              (let ((org-marker-regions
                     (with-current-buffer
                         org-agenda-mail-buffer
                       (setq pa (point-min))
                       (gnus-find-text-property-region (point-min) (point-max) 'org-marker))))
                (cl-loop for marker in org-marker-regions
                         do
                         (add-text-properties
                          (+ p (- (car marker) pa)) (+ p (- (cadr marker) pa))
                          `(org-marker
                            ,(copy-marker (get-text-property (car marker) 'org-marker org-agenda-mail-buffer))))

                         (set-marker (car marker) nil)
                         (set-marker (cadr marker) nil))))

            ;; copy faces via font-lock-face
            (save-restriction
              (narrow-to-region p (point))
              (let ((face-regions (gnus-find-text-property-region (point-min) (point-max) 'face)))
                (cl-loop for range in face-regions
                         do
                         (let ((face (get-text-property (car range) 'face)))
                           (add-text-properties
                            (car range) (cadr range)
                            `(font-lock-face ,face)))


                         (set-marker (car range) nil)
                         (set-marker (cadr range) nil))))

            (kill-buffer org-agenda-mail-buffer)
            (put-text-property p (point) 'keymap
                               org-agenda-keymap)))
        )))

  (defun notmuch-agenda-insert-summary (event zone-map)
    (let* ((summary (icalendar--get-event-property event 'SUMMARY))
           (comment (icalendar--get-event-property event 'COMMENT))
           (location (icalendar--get-event-property event 'LOCATION))
           (organizer (icalendar--get-event-property event 'ORGANIZER))
           (attendees (icalendar--get-event-properties event 'ATTENDEE))
           (summary (when summary (icalendar--convert-string-for-import summary)))
           (comment (when comment (icalendar--convert-string-for-import comment)))

           (dtstart (notmuch-agenda-event-time event zone-map 'DTSTART))
           (dtend (notmuch-agenda-event-time event zone-map 'DTEND))
           (rrule (icalendar--get-event-property event 'RRULE))
           (rdate (icalendar--get-event-property event 'RDATE))
           (duration (icalendar--get-event-property event 'DURATION))
           (description (icalendar--get-event-property event 'DESCRIPTION))

           (friendly-start (+patch/notmuch-agenda-friendly-date dtstart)))

      (when summary (insert (propertize summary 'face '(:underline t :height 1.5)) "\n"))

      (when (or rrule rdate) (insert (format "RRULE: %s %s\n" rrule rdate)))

      (when friendly-start
        (insert (propertize "Start: " 'face 'bold))
        (insert friendly-start "\n"))

      (when comment (insert (propertize "Comment: " 'face 'bold)
                            comment"\n"))

      (when location (insert (propertize "Location: " 'face 'bold)
                             location"\n"))
      (when organizer (insert (propertize "Organizer: " 'face 'bold)
                              (replace-regexp-in-string
                               "^mailto: *" ""
                               organizer)"\n"))
      (when attendees (insert (propertize "Attending: " 'face 'bold))
            (while attendees
              (insert (replace-regexp-in-string
                       "^mailto: *" ""
                       (car attendees)))
              (when (cdr attendees) (insert ", "))
              (setq attendees (cdr attendees)))
            (insert "\n"))

      ;; (when description
      ;;   (insert (read (format "\"%s\"" description))))

      (insert "\n")
      ))

  (defun notmuch-agenda-insert-part (msg part content-type nth depth button)
    (let (icalendar-element)
      (with-temp-buffer
        ;; Get the icalendar text and stick it in a temp buffer
        (insert (notmuch-get-bodypart-text msg part notmuch-show-process-crypto))
        ;; Transform CRLF into LF
        (goto-char (point-min))
        (while (re-search-forward "\r\n" nil t) (replace-match "\n" nil nil))
        ;; Unfold the icalendar text so it can be parsed
        (set-buffer (icalendar--get-unfolded-buffer (current-buffer)))
        ;; Go to the first VCALENDAR object in the result
        (goto-char (point-min))
        (when (re-search-forward "^BEGIN:VCALENDAR\\s-*$")
          (beginning-of-line)
          (setq icalendar-element (icalendar--read-element nil nil)))
        ;; Dispose of the junk buffer produced by icalendar--get-unfolded-buffer
        (kill-buffer (current-buffer)))

      (when icalendar-element
        (let* ((events (icalendar--all-events icalendar-element))
               (zone-map (icalendar--convert-all-timezones icalendar-element)))
          (insert "#+BEGIN_EXAMPLE\n")
          (dolist (event events)
            ;; insert event description string
            (notmuch-agenda-insert-summary event zone-map)
            (notmuch-agenda-insert-agenda event zone-map)
            (insert-button "[ Update agenda ]"
                           :type 'notmuch-show-part-button-type
                           'action 'notmuch-agenda-do-capture
                           'calendar-event event))
          (insert "\n#+END_EXAMPLE\n")
          t))))

  (defun +patch/notmuch-agenda-get-start ()
    "Return the point of the beginning of the message body."
    (save-excursion
      (message-goto-body)
      (search-forward "#+BEGIN_EXAMPLE" nil t)
      (line-beginning-position)))

  (defun +patch/notmuch-agenda-get-end ()
    "Return the point of the beginning of the message body."
    (save-excursion
      (message-goto-body)
      (search-forward "#+END_EXAMPLE" nil t)
      (line-end-position)))

  (fset 'notmuch-show-insert-part-text/calendar #'notmuch-agenda-insert-part))
#+end_src

