.config/doom/modules/email/notmuch-patch/config.el
  (defun notmuch-agenda-datetime-as-iso (datetime)
    "Convert a date retrieved via `icalendar--get-event-property' to ISO format."
    (if datetime
        (format "%04d-%02d-%02d"
                (nth 5 datetime)                  ; Year
                (nth 4 datetime)                  ; Month
                (nth 3 datetime))))



  (defun +patch/notmuch-agenda-org-repeater (rrule)
    (if rrule
        (let* ((rrule-parts (split-string rrule ";" t "\\s-"))
               (parts (mapcar (lambda (p)
                                (let ((parts (split-string p "=")))
                                  (cons (intern (car parts))
                                        (cadr parts))))
                              rrule-parts))
               (freq (alist-get 'FREQ parts))
               (interval (string-to-number (alist-get 'INTERVAL parts "1"))))
          (and freq interval
               (cond
                ((string= freq "DAILY") (format " +%dd" interval))
                ((string= freq "WEEKLY") (format " +%dw" interval))
                ((string= freq "MONTHLY") (format " +%dm" interval))
                ((string= freq "YEARLY") (format " +%dy" interval)))))
      ""))

  (defun notmuch-agenda-org-date (dtstart-dec dtend-dec rrule rdate duration)
    (let* ((start-d (notmuch-agenda-datetime-as-iso dtstart-dec))
           (start-t (icalendar--datetime-to-colontime dtstart-dec))

           end-d end-t

           (repeater (+patch/notmuch-agenda-org-repeater rrule)))

      (setq end-d (if dtend-dec
                      (notmuch-agenda-datetime-as-iso dtend-dec)
                    start-d))

      (setq end-t (if dtend-dec
                      (icalendar--datetime-to-colontime dtend-dec)
                    start-t))

      (if (equal start-d end-d)
          (format "<%s %s-%s%s>" start-d start-t end-t repeater)
        (format "<%s %s>--<%s %s>" start-d start-t end-d end-t))))

  (defvar notmuch-agenda-capture-targets
    `(( ,(rx "tom.hinton@cse.org.uk")
        file "~/notes/agenda/work.org")
      ( ""
        file "~/notes/agenda/calendar.org")))

  (defvar notmuch-agenda-capture-template
    ;; TODO insert also link to email
    "* %:event-summary
:PROPERTIES:
:LOCATION: %:event-location
:SEQUENCE: %:event-sequence
:ORGANIZER: [[%:event-organizer]]
:ID: %:event-uid
:END:
%:event-timestamp
%:event-comment
%:event-description
%a
%?")

  (defvar notmuch-agenda-capturing-event nil)
  (defvar notmuch-agenda-capturing-subject-line nil)
  (defvar notmuch-agenda-capturing-message-id nil)

  (defun notmuch-agenda-store-link ()
    (when notmuch-agenda-capturing-event
      (let ((event notmuch-agenda-capturing-event)
            (zone-map (icalendar--convert-all-timezones (list event)))
            (props (mapcan
                    (lambda (prop)
                      (let* ((val (icalendar--get-event-property event prop))
                             (val (and val (icalendar--convert-string-for-import val))))
                        (list
                         (intern (concat ":event-" (downcase (symbol-name prop))))
                         (or val ""))))

                    (list 'LOCATION 'SEQUENCE 'UID 'SUMMARY 'COMMENT 'ORGANIZER 'DESCRIPTION))))
        (apply 'org-store-link-props
               :type "event"
               :link (format "nm:%s" notmuch-agenda-capturing-message-id)
               :description (format "✉ %s" notmuch-agenda-capturing-subject-line)
               :event-timestamp (notmuch-agenda-org-date
                                 (notmuch-agenda-event-time event zone-map 'DTSTART)
                                 (notmuch-agenda-event-time event zone-map 'DTEND)
                                 (icalendar--get-event-property event 'RRULE)
                                 (icalendar--get-event-property event 'RDATE)
                                 (icalendar--get-event-property event 'DURATION))
               props))
      t))

  (defun notmuch-agenda-org-capture-or-update (event)
    (require 'org-id)
    (require 'org-capture)

    (let ((existing-event (org-id-find (icalendar--get-event-property event 'UID) t)))
      (if existing-event
          (let ((use-dialog-box nil)
                (existing-sequence
                 (org-entry-get existing-event "SEQUENCE")))
            (with-current-buffer
                (pop-to-buffer (marker-buffer existing-event))
              (goto-char existing-event)
              (outline-hide-sublevels 1)
              (outline-show-entry)
              (org-reveal)
              (if (>= (string-to-number existing-sequence)
                      (string-to-number (icalendar--get-event-property event 'SEQUENCE)))
                  (message "Event is already in calendar")
                (when (y-or-n-p "Update event?")
                  (org-entry-put nil "ID" nil)
                  (org-id-update-id-locations (list buffer-file-name))
                  (org-archive-subtree)
                  (notmuch-agenda-org-capture-or-update event))))

            (set-marker existing-event nil nil))

        (let* ((notmuch-agenda-capturing-subject-line
                (notmuch-show-get-subject))

               (notmuch-agenda-capturing-message-id
                (notmuch-show-get-message-id))

               (notmuch-agenda-capturing-event event)

               (org-link-parameters
                '(("nope" :store notmuch-agenda-store-link)))

               (org-overriding-default-time
                (apply 'encode-time
                       (notmuch-agenda-event-time event
                                                  (icalendar--convert-all-timezones (list event))
                                                  'DTSTART)))

               (org-capture-templates
                `(("l" "Capture an event from email invitation"
                   entry
                   ,notmuch-agenda-capture-target
                   ,notmuch-agenda-capture-template))))
          (org-capture t "l")))))

  (defun notmuch-agenda-do-capture (event)
    (let ((calendar-event (plist-get (overlay-properties event) 'calendar-event))
          (notmuch-agenda-capture-target
           (let ((addr (notmuch-show-get-to)))
             (cl-loop
              for tgt in notmuch-agenda-capture-targets
              when (string-match-p (car tgt) addr)
              return (cdr tgt)
              )))
          )
      (notmuch-agenda-org-capture-or-update calendar-event)))

  (defun notmuch-agenda-reply-advice (o &rest args)
    ;; look for any text/calendar parts
    (require 'cl)
    (let* ((responded (cl-intersection (notmuch-show-get-tags)
                                       '("accepted" "declined" "tentative")
                                       :test 'string=
                                       ))

           requires-response

           response

           (query (car args))
           (original (unless responded
                       (notmuch-call-notmuch-sexp
                        "reply" "--format=sexp" "--format-version=4" query)))
           (body (unless responded
                   (plist-get (plist-get original :original)
                              :body))))
      (while body
        (let ((head (car body)))
          (setq body (cdr body))
          (let ((content-type (plist-get head :content-type)))
            (cond
             ((or (string= content-type "multipart/alternative")
                  (string= content-type "multipart/mixed"))
              (setq body (append body (plist-get head :content))))
             ((and (string= content-type "text/calendar")
                   (string-match-p "^METHOD:REQUEST$" (plist-get head :content)))
              (setq requires-response (plist-get head :content)
                    body nil))))))

      (when requires-response
        (setq response (completing-read "Event invitation: "
                                        '("Accepted"
                                          "Declined"
                                          "Tentative"
                                          "Ignore")
                                        nil t)))


      (when (and response (not (string= "Ignore" response)))

        (notmuch-show-tag-message (concat "+" (downcase response))))

      (apply o args)

      (when (and requires-response
                 response
                 (not (string= response "Ignore")))
        (require 'ox-icalendar)
        ;; (require 'imip)

        (make-variable-buffer-local 'message-syntax-checks)
        (push '(illegible-text . disabled) message-syntax-checks)
        (delete-region (+patch/notmuch-agenda-get-start) (+patch/notmuch-agenda-get-end))

        (save-excursion
          (goto-char (point-max))
          (save-excursion
            (mml-insert-part "text/calendar; method=REPLY")
            (insert
             (org-icalendar-fold-string
              (with-temp-buffer
                (insert requires-response)
                (goto-char (point-min))
                (with-current-buffer
                    (icalendar--get-unfolded-buffer (current-buffer))
                  (goto-char (point-min))
                  (setq requires-response (icalendar--read-element nil nil))
                  (kill-buffer))
                (erase-buffer)

                (imip-write-element
                 (imip-respond (car requires-response)
                               '("patrick@the-kelleys.com" "the-kelleys.com")
                               (upcase response)))

                (buffer-string)
                ;; (replace-string "" "")
                )))))
        ;; NOTE have to do this manually, bc message-change-subject appends "was: old-subject" unconditionally
        (let ((new-subject (format "%s: %s"
                                   response
                                   (message-strip-subject-re (message-fetch-field "Subject")))))
          (save-excursion
            (message-goto-subject)
            (message-delete-line)
            (insert (concat "Subject: " new-subject "\n")))))))

  (advice-add 'notmuch-mua-reply :around 'notmuch-agenda-reply-advice))

(after! notmuch
