.config/doom/modules/email/notmuch-patch/config.org
** imip
library for responding to cal invites
#+begin_src emacs-lisp :tangle yes
(after! notmuch
  ;; provides icalendar message-based interoperability protocol
  ;; like rfc6047 but probably full of bugs

  (require 'icalendar)

  (defun imip-respond (invitation addresses response-string)
    "Given the icalendar object for invitation, produce a new one which responds appropriately."
    ;; According to RFC5546 p25, we can send a reply that contains just:
    ;; - method (vevent attendee dtstamp organizer uid sequence)+
    ;; however, outlook doesn't support this because it's stupid
    (let* ((invitation-contents (nth 3 invitation))
           (address-re (rx-to-string `(| ,@addresses)))
           (dtstamp (format-time-string "%Y%m%dT%H%M%SZ" nil t))
           events)

      (dolist (item invitation-contents)
        (cl-case (car item)
          (VTIMEZONE
           (push item events))

          (VEVENT
           (let* ((event-things (nth 2 item))
                  (organizer (assq 'ORGANIZER event-things))
                  (sequence (assq 'SEQUENCE event-things))
                  (uid (assq 'UID event-things))
                  attendees
                  misc)
             (dolist (thing event-things)
               (cl-case (car thing)
                 (ATTENDEE
                  (when (string-match-p address-re (nth 2 thing))
                    (push `(ATTENDEE (PARTSTAT ,response-string) ,(nth 2 thing)) attendees)))
                 ((DTSTART DTEND)
                  (push thing misc))))

             (push `(VEVENT nil (,organizer
                                 ,sequence
                                 ,uid
                                 (DTSTAMP nil ,dtstamp)
                                 ,@attendees
                                 ,@misc))
                   events))
           )))

      ;; (message (format "%s" events))
      `(VCALENDAR nil
        ((METHOD nil "REPLY")
         (PRODID nil "Emacs")
         ;; (CALSCALE nil "GREGORIAN")
         (VERSION nil "2.0"))
        ,events)))


  (defun imip-write-element (icalendar)
    "This is the inverse of icalendar--read-element from icalendar.el.
  It doesn't do stupid icalendar wrappning, nor does it put in CRLFs"

    (cond
     ((symbolp (car icalendar))
      (let ((element-name (nth 0 icalendar))
            (element-attrs (nth 1 icalendar))
            (element-properties (nth 2 icalendar))
            (element-children (nth 3 icalendar)))

        (insert (format "BEGIN:%s" element-name))
        (while element-attrs
          (insert ";")
          (insert (format "%s=%s" (car element-attrs) (cadr element-attrs)))
          (setq element-attrs (cddr element-attrs)))
        (insert "\n")
        (dolist (prop element-properties)
          (let ((prop-name (nth 0 prop))
                (prop-attrs (nth 1 prop)) ;; WHY?
                (prop-val (nth 2 prop)))
            (insert (format "%s" prop-name))
            (while prop-attrs
              (insert ";")
              (insert (format "%s=%s" (car prop-attrs) (cadr prop-attrs)))
              (setq prop-attrs (cddr prop-attrs)))
            (insert (format ":%s\n" prop-val))))
        (dolist (child element-children)
          (imip-write-element child))
        (insert (format "END:%s\n" element-name))))
     ((listp (car icalendar))
      (dolist (sub-element icalendar)
        (imip-write-element sub-element))))))
#+end_src
* interaction with search view
** quick toggle for unread
Macro for toggling the visibility of read messages on/off.
#+name: toggle-unread
#+begin_src emacs-lisp tangle: no
(after! notmuch
  (defun +patch-notmuch/remove-tag-filter (tag-name query-string)
    (or
     (string-replace (format " and tag:%s" tag-name) "" query-string)
     (string-replace (format "tag:%s and " tag-name) "" query-string)
     (string-replace (format "tag:%s" tag-name) "*" query-string)
     query-string))


  (defun +patch-notmuch/toggle-unread ()
    (interactive)
    (let ((query-string (if (string-match "tag:unread" notmuch-search-query-string)
                            (+patch-notmuch/remove-tag-filter "unread" notmuch-search-query-string)
                          (concat notmuch-search-query-string " and tag:unread"))))
      (notmuch-search query-string notmuch-search-oldest-first))))

#+end_src
** unsubscribe macro
Quickly unsubscribe to mailing lists. This just crudely opens the message and searches for "unsubscribe". It goes to the bottom of the email too, so that if the link is labelled something other than "unsubscribe" I can still usually find it quickly after cancelling the search.
#+name: unsubscribe-macro
#+begin_src emacs-lisp :tangle no
(defun +patch-notmuch/unsubscribe ()
  (interactive)
  (notmuch-search-show-thread)
  ;; go to bottom of email, in case the link isn't called "unsubscribe"
  (evil-goto-line)
  (consult-line "unsubscribe"))
#+end_src
** filter to sender at point
#+name: filter-to-sender-at-point
#+begin_src emacs-lisp
(defun +patch-notmuch/filter-to-sender-at-point ()
  (interactive)
  (let* ((email-and-name-at-point (mail-header-parse-address (+patch-notmuch/get-email-from-notmuch-search)))
         (email-at-point (completing-read "Email address to use (wrap in `/` for a pattern): " nil nil nil (car email-and-name-at-point))))
    (notmuch-search (format "from:%s AND NOT tag:trash AND NOT tag:deleted" email-at-point))))
#+end_src
** saved searches
#+begin_src emacs-lisp :tangle yes
(after! notmuch
  (setq notmuch-saved-searches '((:name "pm/imbox"            :query "tag:protonmail AND tag:imbox AND NOT tag:trash AND NOT tag:deleted"       :key "u")
                                 (:name "pm/feed"             :query "tag:protonmail AND tag:feed AND NOT tag:trash AND NOT tag:deleted"        :key "i" :search-type 'tree)
                                 (:name "pm/paper-trail"      :query "tag:protonmail AND tag:paper-trail AND NOT tag:trash AND NOT tag:deleted" :key "o")
                                 (:name "pm/screener"         :query "tag:protonmail AND tag:screener AND NOT tag:trash AND NOT tag:deleted"    :key "p")
                                 (:name "pm/calendar"         :query "tag:protonmail AND tag:calendar AND NOT tag:trash AND NOT tag:deleted"    :key "[")
                                 (:name "kelleys/imbox"       :query "tag:kelleys AND tag:imbox AND NOT tag:trash AND NOT tag:deleted"          :key "h")
                                 (:name "kelleys/feed"        :query "tag:kelleys AND tag:feed AND NOT tag:trash AND NOT tag:deleted"           :key "j" :search-type 'tree)
                                 (:name "kelleys/paper-trail" :query "tag:kelleys AND tag:paper-trail AND NOT tag:trash AND NOT tag:deleted"    :key "k")
                                 (:name "kelleys/screener"    :query "tag:kelleys AND tag:screener AND NOT tag:trash AND NOT tag:deleted"       :key "l")
                                 (:name "kelleys/calendar"    :query "tag:kelleys AND tag:calendar AND NOT tag:trash AND NOT tag:deleted"       :key ";")
                                 (:name "hs/imbox"           :query "tag:human-signal AND tag:imbox AND NOT tag:trash AND NOT tag:deleted"          :key "n")
                                 (:name "hs/feed"            :query "tag:human-signal AND tag:feed AND NOT tag:trash AND NOT tag:deleted"           :key "m" :search-type 'tree)
                                 (:name "hs/paper-trail"     :query "tag:human-signal AND tag:paper-trail AND NOT tag:trash AND NOT tag:deleted"    :key ",")
                                 (:name "hs/screener"        :query "tag:human-signal AND tag:screener AND NOT tag:trash AND NOT tag:deleted"       :key ".")
                                 (:name "hs/calendar"        :query "tag:human-signal AND tag:calendar AND NOT tag:trash AND NOT tag:deleted"       :key "/"))))
#+end_src
